//
// Created by Administrator on 2025/4/20.
//

/**
 * 假币问题:有n枚硬币,其中一枚硬币是假的,已知假币的重量比较轻.现只有一个天平,要求用尽量少的比较次数找出这枚假币
 *
 * 【分析问题】

将n枚硬币分成相等的两部分：
（1）当n为偶数时，将前后两部分，即 1…n/2和n/2+1…n，放在天平的两端，较轻的一端里有假币，继续在较轻的这部分硬币中用同样的方法找出假币；
（2）当n为奇数时，将前后两部分，即1..(n -1)/2和(n+1)/2+1…n，放在天平的两端，较轻的一端里有假币，继续在较轻的这部分硬币中用同样的方法找出假币；
 若两端重量相等，则中间的硬币，即第 (n+1)/2枚硬币是假币。
 */

/**
 * 1. first+(last-first)/2+1
 * 2. firstSum < lastSUm
 * 3. first+(last-first)/2
 * 4. 分治法
 * 5. O(nlog2^n)
 * 6. 2 4
 */
#include <stdio.h>
int main() {
    printf("%s","假币问题求解");
    return 1;
}